---
kind: type
id: T:Autodesk.Revit.DB.Visual.Glazing
source: html/69ec4266-efb4-3c69-a890-4b00d89b070d.htm
---
# Autodesk.Revit.DB.Visual.Glazing

A static class that provides access to the property names that appear in the Glazing visual asset schema.

## Syntax (C#)
```csharp
public static class Glazing
```